#### AddPoints Method

---

|  |
| --- |
| IndexStreamPoint Class   See Also |

Inserts multiple  IndexPoint  instances into the stream and associated buffer.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void AddPoints( 	IList<IndexPoint> points ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddPoints ( _ 	points As IList(Of IndexPoint) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddPoints( 	IList<IndexPoint^>^ points ) ``` |

#### Parameters

points
:   Type:  System.Collections.Generic IList   IndexPoint
     The points to be inserted.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space. |

# See Also

IndexStreamPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace